In [1]:
import pandas as pd
import numpy as np

In [5]:
data=pd.read_csv('data.csv')
data

   ID  Value1  Value2  Value3
0   1      11      30    25.0
1   2      24      48     NaN
2   3      19      28    35.0
3   4      15      32     NaN
4   5      12      20    22.0

In [7]:
x = data.iloc[:,:-1]
y = data.iloc[:,-1].values.reshape(-1,1)

In [9]:


x

   ID  Value1  Value2
0   1      11      30
1   2      24      48
2   3      19      28
3   4      15      32
4   5      12      20

In [11]:
y

array([[25.],
       [nan],
       [35.],
       [nan],
       [22.]])

In [13]:
from sklearn.impute import SimpleImputer

In [15]:
imp = SimpleImputer(missing_values = np.nan , strategy = 'mean')

In [17]:
y_imputed=imp.fit_transform(y)

In [19]:
y_imputed_df = pd.DataFrame(y_imputed,columns=[data.columns[-1]])

In [21]:
imputed_data = pd.concat([x,y_imputed_df],axis=1)

In [23]:
data

   ID  Value1  Value2  Value3
0   1      11      30    25.0
1   2      24      48     NaN
2   3      19      28    35.0
3   4      15      32     NaN
4   5      12      20    22.0

In [25]:
imputed_data

   ID  Value1  Value2     Value3
0   1      11      30  25.000000
1   2      24      48  27.333333
2   3      19      28  35.000000
3   4      15      32  27.333333
4   5      12      20  22.000000